app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO `teams` (`created_at`, `title`, `updated_at`, `depiction`, `description`) VALUES('2009-05-03 22:33:39', 'Scott\'s Awesome Team', '2009-05-03 22:33:39', 'A band of weary singers walk off into the sunset', 'We will rock your nuts off')